app/views/vcenter_credentials/_form.html.erb

    <%= form.label :vcenter_id, 'vCenter', class: 'form-label' %>
    <%= form.collection_select :vcenter_id, Vcenter.all, :id, :name, { prompt: 'Select a vCenter' }, class: 'form-control', id: 'vcenter-select' %>
---
SELECT "vcenters".* FROM "vcenters"