app/views/subnets/new.html.erb

    <%= form.label :vm_network %>
    <%= form.select :vm_network, @vm_networks.map { |network| [network.name, network.id] }, { include_blank: true }, class: 'form-control' %>
---
SELECT "vm_networks".* FROM "vm_networks"