app/controllers/compute_clusters_controller.rb

  def set_datacenter
    @datacenter = @vcenter.datacenters.find(params[:datacenter_id])
---
SELECT "datacenters".* FROM "datacenters" WHERE "datacenters"."vcenter_id" = $1 AND "datacenters"."id" = $2 LIMIT $3  [["vcenter_id", 1], ["id", 1], ["LIMIT", 1]]