app/controllers/datacenters_controller.rb

SELECT "vcenters".* FROM "vcenters" WHERE "vcenters"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
  def set_vcenter
    @vcenter = Vcenter.find(params[:vcenter_id])

SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."vcenter_id" = $1 ORDER BY "vcenter_credentials"."id" ASC LIMIT $2  [["vcenter_id", 41], ["LIMIT", 1]]
---
  def fetch_compute_clusters(datacenter_id)
    require 'fog/vsphere'

    credential = @vcenter.vcenter_credentials.first