app/controllers/subnets_controller.rb

SELECT "subnets".* FROM "subnets"
---
  def index
    @subnets = Subnet.all

SELECT "vm_networks".* FROM "vm_networks"
---
  def new
    @subnet = Subnet.new
    @vm_networks = VmNetwork.all.map { |network| [network.name, network.id] }