app/controllers/subnets_controller.rb

SELECT "vm_networks".* FROM "vm_networks"
---
  def create
    @subnet = Subnet.new(subnet_params)
    if @subnet.save
      redirect_to subnets_path, notice: 'Subnet was successfully created.'
    else
      @vm_networks = VmNetwork.all