app/controllers/subnets_controller.rb

  def fetch_vm_networks
    Vcenter.all.map { |vc| vc.networks }.flatten
---
SELECT "vcenters".* FROM "vcenters"