app/controllers/vcenters_controller.rb

SELECT "vcenters".* FROM "vcenters"
---
  def index
    @vcenters = Vcenter.all

SELECT "datastores".* FROM "datastores" WHERE "datastores"."compute_cluster_id" = $1  [["compute_cluster_id", 1]]
SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."vcenter_id" = $1 ORDER BY "vcenter_credentials"."id" ASC LIMIT $2  [["vcenter_id", 41], ["LIMIT", 1]]
SELECT "vm_networks".* FROM "vm_networks" WHERE "vm_networks"."compute_cluster_id" = $1  [["compute_cluster_id", 1]]
SELECT "datacenters".* FROM "datacenters" WHERE "datacenters"."vcenter_id" = $1  [["vcenter_id", 1]]
---
  def show
    @vcenter_credentials = @vcenter.vcenter_credentials
    @datacenters = @vcenter.datacenters.includes(compute_clusters: [:datastores, :vm_networks])

INSERT INTO "vcenters" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My lab"], ["url", "f"], ["created_at", "2024-06-17 21:40:25.189950"], ["updated_at", "2024-06-17 21:40:25.189950"]]
---
  def create
    @vcenter = Vcenter.new(vcenter_params)
    if @vcenter.save

DELETE FROM "vcenters" WHERE "vcenters"."id" = $1  [["id", 2]]
---
  def destroy
    @vcenter.destroy

SELECT "vcenters".* FROM "vcenters" WHERE "vcenters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_vcenter
    @vcenter = Vcenter.find(params[:id])

SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."vcenter_id" = $1 ORDER BY "vcenter_credentials"."id" ASC LIMIT $2  [["vcenter_id", 1], ["LIMIT", 1]]
INSERT INTO "datacenters" ("name", "vcenter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TNDC"], ["vcenter_id", 1], ["created_at", "2024-06-17 21:46:31.569850"], ["updated_at", "2024-06-17 21:46:31.569850"]]
SELECT "datacenters".* FROM "datacenters" WHERE "datacenters"."vcenter_id" = $1 AND "datacenters"."name" = $2 LIMIT $3  [["vcenter_id", 1], ["name", "TNDC"], ["LIMIT", 1]]
SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."vcenter_id" = $1 ORDER BY "vcenter_credentials"."id" ASC LIMIT $2  [["vcenter_id", 41], ["LIMIT", 1]]
INSERT INTO "datacenters" ("name", "vcenter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TNDC"], ["vcenter_id", 1], ["created_at", "2024-06-17 16:25:53.504875"], ["updated_at", "2024-06-17 16:25:53.504875"]]
INSERT INTO "compute_clusters" ("name", "datacenter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TNCL"], ["datacenter_id", 1], ["created_at", "2024-06-17 21:46:31.712103"], ["updated_at", "2024-06-17 21:46:31.712103"]]
SELECT "compute_clusters".* FROM "compute_clusters" WHERE "compute_clusters"."datacenter_id" = $1 AND "compute_clusters"."name" = $2 LIMIT $3  [["datacenter_id", 1], ["name", "TNCL"], ["LIMIT", 1]]
INSERT INTO "compute_clusters" ("name", "datacenter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TNCL"], ["datacenter_id", 1], ["created_at", "2024-06-17 16:25:53.653166"], ["updated_at", "2024-06-17 16:25:53.653166"]]
INSERT INTO "vm_networks" ("name", "compute_cluster_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "VM Network"], ["compute_cluster_id", 1], ["created_at", "2024-06-17 21:46:31.828179"], ["updated_at", "2024-06-17 21:46:31.828179"]]
SELECT "vm_networks".* FROM "vm_networks" WHERE "vm_networks"."compute_cluster_id" = $1 AND "vm_networks"."name" = $2 LIMIT $3  [["compute_cluster_id", 1], ["name", "VM Network"], ["LIMIT", 1]]
INSERT INTO "datastores" ("name", "type", "capacity", "compute_cluster_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "cloud (1)"], ["type", nil], ["capacity", nil], ["compute_cluster_id", 1], ["created_at", "2024-06-17 21:46:31.926965"], ["updated_at", "2024-06-17 21:46:31.926965"]]
SELECT "datastores".* FROM "datastores" WHERE "datastores"."compute_cluster_id" = $1 AND "datastores"."name" = $2 LIMIT $3  [["compute_cluster_id", 1], ["name", "cloud (1)"], ["LIMIT", 1]]
---
  def fetch_and_store_datacenters(vcenter)
    require 'fog/vsphere'

    credential = vcenter.vcenter_credentials.first
    return unless credential

    connection = Fog::Compute.new(
      provider: 'Vsphere',
      vsphere_username: credential.username,
      vsphere_password: credential.password,
      vsphere_server: vcenter.url,
      vsphere_ssl: credential.ssl_verification,
      vsphere_expected_pubkey_hash: 'a7401d408f9a4ac60848fe34242a9a9c89fcfb73231b2053f64540e8fb03721e',
      vsphere_insecure: !credential.ssl_verification
    )

    connection.datacenters.all.each do |datacenter|
      dc = vcenter.datacenters.find_or_create_by(name: datacenter.name)
      datacenter.clusters.each do |cluster|
        cc = dc.compute_clusters.find_or_create_by(name: cluster.name)
        cluster.networks.each do |network|
          cc.vm_networks.find_or_create_by(name: network.name)
        end
        cluster.datastores.each do |datastore|
          cc.datastores.find_or_create_by(name: datastore.name)