app/controllers/vcenter_credentials_controller.rb

INSERT INTO "vcenter_credentials" ("vsphere_server", "username", "password", "vcenter_id", "ssl_verification", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @vcenter_credential = VcenterCredential.new(vcenter_credential_params)
    if @vcenter_credential.save

SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."vcenter_id" = $1 AND "vcenter_credentials"."id" = $2 LIMIT $3  [["vcenter_id", 4], ["id", 4], ["LIMIT", 1]]
---
  def edit
    @vcenter_credential = VcenterCredential.find(params[:id])

SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "vcenter_credentials" SET "username" = $1, "password" = $2, "updated_at" = $3 WHERE "vcenter_credentials"."id" = $4  [["username", "administrator@lou.land"], ["password", "[FILTERED]"], ["updated_at", "2024-06-17 21:46:23.684305"], ["id", 1]]
---
  def update
    @vcenter_credential = VcenterCredential.find(params[:id])
    if @vcenter_credential.update(vcenter_credential_params)

SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "vcenter_credentials" WHERE "vcenter_credentials"."id" = $1  [["id", 9]]
---
  def destroy
    @vcenter_credential = VcenterCredential.find(params[:id])
    @vcenter_credential.destroy

SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def verify
    @vcenter_credential = VcenterCredential.find(params[:id])

SELECT "vcenters".* FROM "vcenters" WHERE "vcenters"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
---
  def set_vcenter
    @vcenter = Vcenter.find(params[:vcenter_id])

SELECT "vcenter_credentials".* FROM "vcenter_credentials" WHERE "vcenter_credentials"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def set_vcenter_credential
    @vcenter_credential = VcenterCredential.find(params[:id])