app/controllers/vcenters_controller.rb

SELECT "compute_clusters".* FROM "compute_clusters" WHERE "compute_clusters"."datacenter_id" = $1  [["datacenter_id", 1]]
---
  def show
    @vcenter_credentials = @vcenter.vcenter_credentials
    @datacenters = @vcenter.datacenters.includes(:compute_clusters)