app/models/vcenter.rb

SELECT "networks".* FROM "networks" WHERE "networks"."vcenter_id" = $1  [["vcenter_id", 1]]
INSERT INTO "networks" ("name", "vcenter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "VM Network"], ["vcenter_id", 1], ["created_at", "2024-06-17 21:46:26.215115"], ["updated_at", "2024-06-17 21:46:26.215115"]]
---
  def update_networks
    credential = vcenter_credentials.first
    return if credential.nil?

    connection = Fog::Compute.new(
      provider: 'Vsphere',
      vsphere_username: credential.username,
      vsphere_password: credential.password,
      vsphere_server: url,
      vsphere_ssl: credential.ssl_verification,
      vsphere_expected_pubkey_hash: 'a7401d408f9a4ac60848fe34242a9a9c89fcfb73231b2053f64540e8fb03721e',
      vsphere_insecure: !credential.ssl_verification
    )

    new_networks = connection.networks.all.map(&:name)
    transaction do
      networks.destroy_all
      new_networks.each { |network| networks.create(name: network) }