app/views/vcenters/show.html.erb

            <% @datacenters.each do |datacenter_hash| %>
              <% datacenter_hash[:compute_clusters].each do |cluster_hash| %>
---
SELECT "compute_clusters".* FROM "compute_clusters" WHERE "compute_clusters"."datacenter_id" = $1  [["datacenter_id", 1]]

                  <td><%= number_to_human_size(cluster_hash[:total_storage]) %></td>
                  <td><%= link_to cluster_hash[:vm_networks].count, vcenter_datacenter_compute_cluster_networks_path(@vcenter, datacenter_hash[:datacenter], cluster_hash[:cluster]) %></td>
---
SELECT "datacenters".* FROM "datacenters" WHERE "datacenters"."vcenter_id" = $1  [["vcenter_id", 1]]
SELECT "vm_networks".* FROM "vm_networks" WHERE "vm_networks"."compute_cluster_id" = $1  [["compute_cluster_id", 1]]